
import { Subject } from './types';

export const SYLLABUS: Subject[] = [
  {
    id: 'math',
    name: 'Higher Math',
    papers: {
      first: {
        name: 'Higher Math 1st',
        chapters: [
          { id: 'm1-1', name: 'অধ্যায় ০১: ম্যাট্রিক্স ও নির্ণায়ক' },
          { id: 'm1-2', name: 'অধ্যায় ০২: ভেক্টর' },
          { id: 'm1-3', name: 'অধ্যায় ০৩: সরলরেখা' },
          { id: 'm1-4', name: 'অধ্যায় ০৪: বৃত্ত' },
          { id: 'm1-5', name: 'অধ্যায় ০৫: বিন্যাস ও সমাবেশ' },
          { id: 'm1-6', name: 'অধ্যায় ০৬: ত্রিকোণমিতিক অনুপাত' },
          { id: 'm1-7', name: 'অধ্যায় ০৭: সংযুক্ত কোণের ত্রিকোণমিতিক অনুপাত' },
          { id: 'm1-8', name: 'অধ্যায় ০৮: ফাংশন ও ফাংশনের লেখচিত্র' },
          { id: 'm1-9', name: 'অধ্যায় ০৯: অন্তরীকরণ' },
          { id: 'm1-10', name: 'অধ্যায় ১০: যোগজীকরণ' },
        ],
      },
      second: {
        name: 'Higher Math 2nd',
        chapters: [
          { id: 'm2-1', name: '১ম অধ্যায়: বাস্তব সংখ্যা ও অসমতা' },
          { id: 'm2-2', name: '২য় অধ্যায়: যোগাশ্রয়ী প্রোগ্রাম' },
          { id: 'm2-3', name: '৩য় অধ্যায়: জটিল সংখ্যা' },
          { id: 'm2-4', name: '৪র্থ অধ্যায়: বহুপদী ও বহুপদী সমীকরণ' },
          { id: 'm2-5', name: '৫ম অধ্যায়: দ্বিপদী বিস্তৃতি' },
          { id: 'm2-6', name: '৬ষ্ঠ অধ্যায়: কনিক' },
          { id: 'm2-7', name: '৭ম অধ্যায়: বিপরীত ত্রিকোণমিতি ও ত্রিকোণমিতিক' },
          { id: 'm2-8', name: '৮ম অধ্যায়: স্থিতিবিদ্যা' },
          { id: 'm2-9', name: '৯ম অধ্যায়: সমতলে বস্তুকণার গতি' },
          { id: 'm2-10', name: '১০ম অধ্যায়: যোগজীকরণ' },
        ],
      },
    },
  },
  {
    id: 'physics',
    name: 'Physics',
    papers: {
      first: {
        name: 'Physics 1st',
        chapters: [
          { id: 'p1-1', name: 'অধ্যায় ০১- ভৌতজগৎ ও পরিমাপ' },
          { id: 'p1-2', name: 'অধ্যায় ০২-ভেক্টর' },
          { id: 'p1-3', name: 'অধ্যায় ০৩- গতিবিদ্যা' },
          { id: 'p1-4', name: 'অধ্যায় ০৪- নিউটনিয়ান বলবিদ্যা' },
          { id: 'p1-5', name: 'অধ্যায় ০৫- কাজ শক্তি ও ক্ষমতা' },
          { id: 'p1-6', name: 'অধ্যায় ০৬- মহাকর্ষ ও অভিকর্ষ' },
          { id: 'p1-7', name: 'অধ্যায় ০৭- পদার্থের গাঠনিক ধর্ম' },
          { id: 'p1-8', name: 'অধ্যায় ০৮- পর্যায়বৃত্ত গতি' },
          { id: 'p1-10', name: 'অধ্যায় ১০- গ্যাসের গতি তত্ত্ব' },
        ],
      },
      second: {
        name: 'Physics 2nd',
        chapters: [
          { id: 'p2-1', name: 'অধ্যায় ০১ - তাপ গতি বিদ্যা' },
          { id: 'p2-2', name: 'অধ্যায় ০২ -স্থির তড়িৎ' },
          { id: 'p2-3', name: 'অধ্যায় ০৩ - চল তড়িৎ' },
          { id: 'p2-4', name: 'অধ্যায় ০৪ - তড়িৎ প্রবাহের চৌম্বক ক্রিয়া ও চুম্বকত্ব' },
          { id: 'p2-5', name: 'অধ্যায় ০৫ - তাড়িতচৌম্বকীয় আবেশ ও পরিবর্তী প্রবাহ' },
          { id: 'p2-6', name: 'অধ্যায় ০৬ - জ্যামিতিক আলোকবিজ্ঞান' },
          { id: 'p2-7', name: 'অধ্যায় ০৭ - ভৌত আলোকবিজ্ঞান এইচএসসি' },
          { id: 'p2-8', name: 'অধ্যায় ০৮ - আধুনিক পদার্থ বিজ্ঞান' },
          { id: 'p2-9', name: 'অধ্যায় ০৯ - পরমাণুর মডেল এবং নিউক্লিয়ার' },
          { id: 'p2-10', name: 'অধ্যায় ১০ - সেমিকন্ডাক্টর ও ইলেকট্রনিক্স' },
          { id: 'p2-11', name: 'অধ্যায় ১১ - জ্যোতি বিজ্ঞান' },
        ],
      },
    },
  },
  {
    id: 'chemistry',
    name: 'Chemistry',
    papers: {
      first: {
        name: 'Chemistry 1st',
        chapters: [
          { id: 'c1-1', name: 'অধ্যায় ০১ - ল্যাবরেটরির নিরাপদ ব্যবহার' },
          { id: 'c1-2', name: 'অধ্যায় ০২ - গুণগত রসায়ন' },
          { id: 'c1-3', name: 'অধ্যায় ০৩- মৌলের পর্যায়বৃত্ত ধর্ম ও রাসায়নিক' },
          { id: 'c1-4', name: 'অধ্যায় ০৪- রাসায়নিক পরিবর্তন' },
          { id: 'c1-5', name: 'অধ্যায় ০৫- কর্মমুখী রসায়ন' },
        ],
      },
      second: {
        name: 'Chemistry 2nd',
        chapters: [
          { id: 'c2-1', name: 'অধ্যায় ০১- পরিবেশ রসায়ন' },
          { id: 'c2-2', name: 'অধ্যায় ০২- জৈব রসায়ন' },
          { id: 'c2-3', name: 'অধ্যায় ০৩- পরিমাণগত রসায়ন' },
          { id: 'c2-4', name: 'অধ্যায় ০৪- তড়িৎ রসায়ন' },
          { id: 'c2-5', name: 'অধ্যায় ০৫- অর্থনৈতিক রসায়ন' },
        ],
      },
    },
  },
  {
    id: 'biology',
    name: 'Biology',
    papers: {
      first: {
        name: 'Biology 1st',
        chapters: [
          { id: 'b1-1', name: 'অধ্যায় - ১: কোষ ও এর গঠন' },
          { id: 'b1-2', name: 'অধ্যায় - ২: কোষ বিভাজন' },
          { id: 'b1-3', name: 'অধ্যায় - ৩: কোষ রসায়ন' },
          { id: 'b1-4', name: 'অধ্যায় - ৪: অণুজীব' },
          { id: 'b1-5', name: 'অধ্যায় - ৫: শৈবাল ও ছত্রাক' },
          { id: 'b1-6', name: 'অধ্যায় - ৬: ব্রায়োফাইটা ও টেরিডোফাইটা' },
          { id: 'b1-7', name: 'অধ্যায় - ৭: নগ্নবীজী ও আবৃতবীজী উদ্ভিদ' },
          { id: 'b1-8', name: 'অধ্যায় - ৮: টিস্যু ও টিস্যুতন্ত্র' },
          { id: 'b1-9', name: 'অধ্যায় - ৯: উদ্ভিদ শারীরতত্ত্ব' },
          { id: 'b1-10', name: 'অধ্যায় - ১০: উদ্ভিদ প্রজনন' },
          { id: 'b1-11', name: 'অধ্যায় - ১১: জীবপ্রযুক্তি' },
          { id: 'b1-12', name: 'অধ্যায় - ১২: জীবের পরিবেশ, বিস্তার ও সংরক্ষণ' },
        ],
      },
      second: {
        name: 'Biology 2nd',
        chapters: [
          { id: 'b2-1', name: 'অধ্যায় ০১- প্রাণীর বিভিন্নতা ও শ্রেণীবিন্যাস' },
          { id: 'b2-2', name: 'অধ্যায় ০২- প্রাণীর পরিচিতি' },
          { id: 'b2-3', name: 'অধ্যায় ০৩- মানব শারীরতত্ত্ব-পরিপাক ও শোষণ' },
          { id: 'b2-4', name: 'অধ্যায় ০৪- মানব শারীরতত্ত্ব -রক্ত' },
          { id: 'b2-5', name: 'অধ্যায় ০৫- মানব শারীরতত্ত্ব-শ্বসন ও শ্বাসক্রিয়া' },
          { id: 'b2-6', name: 'অধ্যায় ০৬- মানব শারীরতত্ত্ব-বর্জ্য ও নিষ্কাশন' },
          { id: 'b2-7', name: 'অধ্যায় ০৭- মানব শারীরতত্ত্ব-চলন ও অঙ্গচালনা' },
          { id: 'b2-8', name: 'অধ্যায় ০৮- মানব শারীরতত্ত্ব-সমন্বয় ও নিয়ন্ত্রণ' },
          { id: 'b2-9', name: 'অধ্যায় ০৯- মানব জীবনের ধারাবাহিকতা' },
          { id: 'b2-10', name: 'অধ্যায় ১০- মানবদেহের প্রতিরক্ষা' },
          { id: 'b2-11', name: 'অধ্যায় ১১- জিনতত্ত্ব ও বিবর্তন' },
          { id: 'b2-12', name: 'অধ্যায় ১২-প্রাণীর আচরণ' },
        ],
      },
    },
  },
];
